In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('student_performance.csv')
df

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Parental_Education,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score,Previous_Year_Score,Final_Percentage,Performance_Level,Pass_Fail
0,S0001,15,Male,12,1.0,65.0,Postgraduate,No,No,40.0,NaN,72.0,81.0,50.33,Average,Pass
1,S0002,19,Female,9,NaN,58.0,Graduate,No,Yes,80.0,44.0,35.0,47.0,53.00,Average,Pass
2,S0003,14,Female,12,3.6,NaN,High School,Yes,Yes,83.0,73.0,59.0,58.0,71.67,Good,Pass
3,S0004,18,Female,9,5.5,68.0,Postgraduate,Yes,No,68.0,NaN,77.0,54.0,64.33,Average,Pass
4,S0005,14,Male,10,5.0,80.0,High School,Yes,No,41.0,46.0,36.0,68.0,41.00,Poor,Fail
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.0,50.0,Graduate,No,No,64.0,60.0,70.0,93.0,64.67,Average,Pass
4996,S4997,19,Male,10,5.6,90.0,High School,Yes,No,44.0,59.0,43.0,63.0,48.67,Poor,Fail
4997,S4998,16,Female,9,2.3,61.0,Graduate,No,No,95.0,41.0,82.0,62.0,72.67,Good,Pass
4998,S4999,15,Male,11,2.9,82.0,Graduate,No,Yes,66.0,45.0,61.0,75.0,57.33,Average,Pass
4999,S5000,19,Female,10,2.0,97.0,Postgraduate,No,Yes,69.0,53.0,87.0,77.0,69.67,Good,Pass

In [3]:
df.shape

(5000, 16)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 16 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Student_ID                  5000 non-null   object
 1   Age                         5000 non-null   int64
 2   Gender                      5000 non-null   object
 3   Class                       5000 non-null   int64
 4   Study_Hours_Per_Day         4997 non-null   float64
 5   Attendance_Percentage       4997 non-null   float64
 6   Parental_Education          4998 non-null   object
 7   Internet_Access             5000 non-null   object
 8   Extracurricular_Activities  4999 non-null   object
 9   Math_Score                  4998 non-null   float64
 10  Science_Score               4994 non-null   float64
 11  English_Score               4997 non-null   float64
 12  Previous_Year_Score         4999 non-null   float64
 13  Final_Percentage            4998 non-null   float64
 14  Performance_Level           5000 non-null   object
 15  Pass_Fail                   5000 non-null   object
dtypes: float64(7), int64(2), object(7)
memory usage: 625.1+ KB

In [5]:
df.astype({'Age':'int64'})

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Parental_Education,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score,Previous_Year_Score,Final_Percentage,Performance_Level,Pass_Fail
0,S0001,15,Male,12,1.0,65.0,Postgraduate,No,No,40.0,NaN,72.0,81.0,50.33,Average,Pass
1,S0002,19,Female,9,NaN,58.0,Graduate,No,Yes,80.0,44.0,35.0,47.0,53.00,Average,Pass
2,S0003,14,Female,12,3.6,NaN,High School,Yes,Yes,83.0,73.0,59.0,58.0,71.67,Good,Pass
3,S0004,18,Female,9,5.5,68.0,Postgraduate,Yes,No,68.0,NaN,77.0,54.0,64.33,Average,Pass
4,S0005,14,Male,10,5.0,80.0,High School,Yes,No,41.0,46.0,36.0,68.0,41.00,Poor,Fail
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.0,50.0,Graduate,No,No,64.0,60.0,70.0,93.0,64.67,Average,Pass
4996,S4997,19,Male,10,5.6,90.0,High School,Yes,No,44.0,59.0,43.0,63.0,48.67,Poor,Fail
4997,S4998,16,Female,9,2.3,61.0,Graduate,No,No,95.0,41.0,82.0,62.0,72.67,Good,Pass
4998,S4999,15,Male,11,2.9,82.0,Graduate,No,Yes,66.0,45.0,61.0,75.0,57.33,Average,Pass
4999,S5000,19,Female,10,2.0,97.0,Postgraduate,No,Yes,69.0,53.0,87.0,77.0,69.67,Good,Pass

In [6]:
df.drop(['Parental_Education','Previous_Year_Score','Final_Percentage','Performance_Level','Pass_Fail'],inplace = True,axis = 1)
df.head()

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score
0,S0001,15,Male,12,1.0,65.0,No,No,40.0,NaN,72.0
1,S0002,19,Female,9,NaN,58.0,No,Yes,80.0,44.0,35.0
2,S0003,14,Female,12,3.6,NaN,Yes,Yes,83.0,73.0,59.0
3,S0004,18,Female,9,5.5,68.0,Yes,No,68.0,NaN,77.0
4,S0005,14,Male,10,5.0,80.0,Yes,No,41.0,46.0,36.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Student_ID                  5000 non-null   object
 1   Age                         5000 non-null   int64
 2   Gender                      5000 non-null   object
 3   Class                       5000 non-null   int64
 4   Study_Hours_Per_Day         4997 non-null   float64
 5   Attendance_Percentage       4997 non-null   float64
 6   Internet_Access             5000 non-null   object
 7   Extracurricular_Activities  4999 non-null   object
 8   Math_Score                  4998 non-null   float64
 9   Science_Score               4994 non-null   float64
 10  English_Score               4997 non-null   float64
dtypes: float64(5), int64(2), object(4)
memory usage: 429.8+ KB

In [8]:
df.describe()

,Age,Class,Study_Hours_Per_Day,Attendance_Percentage,Math_Score,Science_Score,English_Score
count,5000.000000,5000.000000,4997.000000,4997.000000,4998.000000,4994.000000,4997.000000
mean,16.508800,10.496400,3.288593,74.922153,67.755302,66.906688,67.791075
std,1.718637,1.106812,1.587496,14.676446,18.727893,19.139513,19.244663
min,14.000000,9.000000,0.500000,50.000000,35.000000,35.000000,35.000000
25%,15.000000,10.000000,1.900000,62.000000,52.000000,50.000000,51.000000
50%,17.000000,10.000000,3.300000,75.000000,68.000000,67.000000,68.000000
75%,18.000000,11.000000,4.700000,88.000000,84.000000,83.000000,85.000000
max,19.000000,12.000000,6.000000,100.000000,100.000000,100.000000,100.000000

In [9]:
df.isna()

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score
0,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,True,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4995,False,False,False,False,False,False,False,False,False,False,False
4996,False,False,False,False,False,False,False,False,False,False,False
4997,False,False,False,False,False,False,False,False,False,False,False
4998,False,False,False,False,False,False,False,False,False,False,False
4999,False,False,False,False,False,False,False,False,False,False,False

In [10]:
df['Study_Hours_Per_Day'].fillna(df['Study_Hours_Per_Day'].mean(),inplace = True)
df['Math_Score'].fillna(df['Math_Score'].mean(),inplace = True)
df['Science_Score'].fillna(df['Science_Score'].mean(),inplace = True)
df['Attendance_Percentage'].fillna(df['Attendance_Percentage'].mean(),inplace=True)
df

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score
0,S0001,15,Male,12,1.000000,65.000000,No,No,40.0,66.906688,72.0
1,S0002,19,Female,9,3.288593,58.000000,No,Yes,80.0,44.000000,35.0
2,S0003,14,Female,12,3.600000,74.922153,Yes,Yes,83.0,73.000000,59.0
3,S0004,18,Female,9,5.500000,68.000000,Yes,No,68.0,66.906688,77.0
4,S0005,14,Male,10,5.000000,80.000000,Yes,No,41.0,46.000000,36.0
...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.000000,50.000000,No,No,64.0,60.000000,70.0
4996,S4997,19,Male,10,5.600000,90.000000,Yes,No,44.0,59.000000,43.0
4997,S4998,16,Female,9,2.300000,61.000000,No,No,95.0,41.000000,82.0
4998,S4999,15,Male,11,2.900000,82.000000,No,Yes,66.0,45.000000,61.0
4999,S5000,19,Female,10,2.000000,97.000000,No,Yes,69.0,53.000000,87.0

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Student_ID                  5000 non-null   object
 1   Age                         5000 non-null   int64
 2   Gender                      5000 non-null   object
 3   Class                       5000 non-null   int64
 4   Study_Hours_Per_Day         5000 non-null   float64
 5   Attendance_Percentage       5000 non-null   float64
 6   Internet_Access             5000 non-null   object
 7   Extracurricular_Activities  4999 non-null   object
 8   Math_Score                  5000 non-null   float64
 9   Science_Score               5000 non-null   float64
 10  English_Score               4997 non-null   float64
dtypes: float64(5), int64(2), object(4)
memory usage: 429.8+ KB

In [12]:
#df[df['Extracurricular_Activities'].isna()]
df[df[['Extracurricular_Activities', 'English_Score']].isna().any(axis=1)]

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score
8,S0009,18,Female,11,3.5,61.0,No,No,55.0,39.0,NaN
12,S0013,19,Male,10,1.5,64.0,Yes,Yes,35.0,95.0,NaN
29,S0030,16,Female,11,3.5,69.0,Yes,Yes,81.0,68.0,NaN
69,S0070,16,Female,9,5.8,91.0,Yes,NaN,93.0,93.0,41.0

In [13]:

df.loc[69,'Extracurricular_Activities'] = 'Yes'
df.loc[8,'English_Score'] = 90
df.loc[12,'English_Score'] = 85
df.loc[29,'English_Score'] = 95

In [14]:
df['Average_Score']= (df["Math_Score"] + df["Science_Score"] + df["English_Score"])/3
df["Average_Score"] = df["Average_Score"].round(2)

In [15]:
df["Total_Score"] = df["Math_Score"] + df["Science_Score"] + df["English_Score"]
df["Total_Score"] = df["Total_Score"].round(2)
df

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score,Average_Score,Total_Score
0,S0001,15,Male,12,1.000000,65.000000,No,No,40.0,66.906688,72.0,59.64,178.91
1,S0002,19,Female,9,3.288593,58.000000,No,Yes,80.0,44.000000,35.0,53.00,159.00
2,S0003,14,Female,12,3.600000,74.922153,Yes,Yes,83.0,73.000000,59.0,71.67,215.00
3,S0004,18,Female,9,5.500000,68.000000,Yes,No,68.0,66.906688,77.0,70.64,211.91
4,S0005,14,Male,10,5.000000,80.000000,Yes,No,41.0,46.000000,36.0,41.00,123.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.000000,50.000000,No,No,64.0,60.000000,70.0,64.67,194.00
4996,S4997,19,Male,10,5.600000,90.000000,Yes,No,44.0,59.000000,43.0,48.67,146.00
4997,S4998,16,Female,9,2.300000,61.000000,No,No,95.0,41.000000,82.0,72.67,218.00
4998,S4999,15,Male,11,2.900000,82.000000,No,Yes,66.0,45.000000,61.0,57.33,172.00
4999,S5000,19,Female,10,2.000000,97.000000,No,Yes,69.0,53.000000,87.0,69.67,209.00

In [16]:
df['Percentage'] = (df['Total_Score']/300)*100
df['Percentage'] = df['Percentage'].round(2)
df

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score,Average_Score,Total_Score,Percentage
0,S0001,15,Male,12,1.000000,65.000000,No,No,40.0,66.906688,72.0,59.64,178.91,59.64
1,S0002,19,Female,9,3.288593,58.000000,No,Yes,80.0,44.000000,35.0,53.00,159.00,53.00
2,S0003,14,Female,12,3.600000,74.922153,Yes,Yes,83.0,73.000000,59.0,71.67,215.00,71.67
3,S0004,18,Female,9,5.500000,68.000000,Yes,No,68.0,66.906688,77.0,70.64,211.91,70.64
4,S0005,14,Male,10,5.000000,80.000000,Yes,No,41.0,46.000000,36.0,41.00,123.00,41.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.000000,50.000000,No,No,64.0,60.000000,70.0,64.67,194.00,64.67
4996,S4997,19,Male,10,5.600000,90.000000,Yes,No,44.0,59.000000,43.0,48.67,146.00,48.67
4997,S4998,16,Female,9,2.300000,61.000000,No,No,95.0,41.000000,82.0,72.67,218.00,72.67
4998,S4999,15,Male,11,2.900000,82.000000,No,Yes,66.0,45.000000,61.0,57.33,172.00,57.33
4999,S5000,19,Female,10,2.000000,97.000000,No,Yes,69.0,53.000000,87.0,69.67,209.00,69.67

In [17]:
for x in df['Percentage']:
    if x>=85:
        df.loc[df['Percentage']==x,'Performance_Level']='Excellent'
    elif x>=70:
        df.loc[df['Percentage']==x,'Performance_Level']='Good'
    elif x>=50:
        df.loc[df['Percentage']==x,'Performance_Level']='Average'
    else:
        df.loc[df['Percentage']==x,'Performance_Level']='Poor'

In [ ]:
df['Status'] = df['Percentage'].apply(lambda x: 'Pass' if x>=40 else 'Fail')
df

,Student_ID,Age,Gender,Class,Study_Hours_Per_Day,Attendance_Percentage,Internet_Access,Extracurricular_Activities,Math_Score,Science_Score,English_Score,Average_Score,Total_Score,Percentage,Performance_Level,Status
0,S0001,15,Male,12,1.000000,65.000000,No,No,40.0,66.906688,72.0,59.64,178.91,59.64,Average,Pass
1,S0002,19,Female,9,3.288593,58.000000,No,Yes,80.0,44.000000,35.0,53.00,159.00,53.00,Average,Pass
2,S0003,14,Female,12,3.600000,74.922153,Yes,Yes,83.0,73.000000,59.0,71.67,215.00,71.67,Good,Pass
3,S0004,18,Female,9,5.500000,68.000000,Yes,No,68.0,66.906688,77.0,70.64,211.91,70.64,Good,Pass
4,S0005,14,Male,10,5.000000,80.000000,Yes,No,41.0,46.000000,36.0,41.00,123.00,41.00,Poor,Pass
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S4996,17,Male,11,4.000000,50.000000,No,No,64.0,60.000000,70.0,64.67,194.00,64.67,Average,Pass
4996,S4997,19,Male,10,5.600000,90.000000,Yes,No,44.0,59.000000,43.0,48.67,146.00,48.67,Poor,Pass
4997,S4998,16,Female,9,2.300000,61.000000,No,No,95.0,41.000000,82.0,72.67,218.00,72.67,Good,Pass
4998,S4999,15,Male,11,2.900000,82.000000,No,Yes,66.0,45.000000,61.0,57.33,172.00,57.33,Average,Pass
4999,S5000,19,Female,10,2.000000,97.000000,No,Yes,69.0,53.000000,87.0,69.67,209.00,69.67,Average,Pass